// 픽셀 셰이더 : 프래그먼트마다 계산되는 연산 프로그램
// 프래그먼트의 최종 색상을 계산한다.

/********************************************************/
/* Structs */
/********************************************************/
// 픽셀 셰이더가 받을 구조체
struct PixelInputType
{
    float4 position : SV_POSITION;
    float4 color : COLOR;
};


/********************************************************/
/* Main */
/********************************************************/
// 최종 색상 결과를 출력하기 때문에 float4를 반환한다(R,G,B,A)
float4 main(PixelInputType input):SV_TARGET
{
	return input.color;
}